; domain
;; ============================================================
;; DOMAIN: rover-mineral-transport
;; ------------------------------------------------------------
;; Autor: Equipo Actividad 3 — Razonamiento y planificacion automatica
;; Curso: Maestria, Primer Semestre
;; Fecha: 2026-05-11
;;
;; Descripcion: Modelo de planificacion clasica para un robot tipo
;;   rover que debe trasladar minerales desde localidades de origen
;;   hasta uno o mas laboratorios para su analisis.
;;
;; Decisiones de modelado (ver docs/01-pddl-modeling-decisions.md):
;;   ADR-001: capacidad del rover = 1 mineral a la vez (forzamos
;;            replanificacion y planes mas ricos que carga ilimitada).
;;   ADR-002: funcion de costo = unitaria por accion (total-cost).
;;            Compatible con planners optimal track del IPC2018.
;;   ADR-003: aristas dirigidas representadas con predicado
;;            (path ?from ?to). Para bidireccionales se declaran
;;            dos atomos (uno por sentido) en el problem.pddl.
;;   ADR-004: "mal tiempo" no se modela como literal — el enunciado
;;            lo usa como motivo narrativo de por que el rover no
;;            puede trasladar todos los minerales de una vez; ya
;;            queda capturado por la capacidad = 1.
;; ============================================================

(define (domain rover-mineral-transport)

  (:requirements
    :typing
    :action-costs)

  ;; -------- Tipos --------
  (:types
    location  ;; nodos del grafo (L1, L2, ...)
    mineral   ;; rocas que el rover debe transportar
    rover     ;; el robot que se mueve
  )

  ;; -------- Predicados --------
  (:predicates
    ;; Posicion del rover
    (at ?r - rover ?l - location)

    ;; Conectividad del grafo (arista dirigida)
    (path ?from - location ?to - location)

    ;; Estado de los minerales
    (mineral-at ?m - mineral ?l - location)
    (carrying  ?r - rover    ?m - mineral)
    (analyzed  ?m - mineral)

    ;; Capacidad del rover (ADR-001): exclusion mutua "free / carrying"
    (free ?r - rover)

    ;; Marca de laboratorio (puede haber 1 o N en distintos problems)
    (lab-at ?l - location)
  )

  ;; -------- Funciones --------
  (:functions
    (total-cost) - number
  )

  ;; ============================================================
  ;; Acciones
  ;; ============================================================

  ;; Mover el rover por una arista existente del grafo.
  (:action move
    :parameters (?r - rover ?from - location ?to - location)
    :precondition (and
      (at ?r ?from)
      (path ?from ?to)
    )
    :effect (and
      (not (at ?r ?from))
      (at ?r ?to)
      (increase (total-cost) 1)
    )
  )

  ;; Recoger un mineral en la localidad actual.
  ;; Solo posible si el rover esta libre (capacidad = 1).
  (:action pickup
    :parameters (?r - rover ?m - mineral ?l - location)
    :precondition (and
      (at ?r ?l)
      (mineral-at ?m ?l)
      (free ?r)
    )
    :effect (and
      (carrying ?r ?m)
      (not (mineral-at ?m ?l))
      (not (free ?r))
      (increase (total-cost) 1)
    )
  )

  ;; Entregar el mineral en un laboratorio.
  ;; Tras la entrega, el mineral queda analizado y el rover libre.
  (:action deliver
    :parameters (?r - rover ?m - mineral ?l - location)
    :precondition (and
      (at ?r ?l)
      (lab-at ?l)
      (carrying ?r ?m)
    )
    :effect (and
      (analyzed ?m)
      (not (carrying ?r ?m))
      (free ?r)
      (increase (total-cost) 1)
    )
  )

)

; problem
;; ============================================================
;; PROBLEM 3: "Dos laboratorios con asignacion oportunista"
;; ------------------------------------------------------------
;; Autor: Adonai Samael Hernandez Mata
;; Programa: Maestria en Inteligencia Artificial - UNIR
;; Curso: Razonamiento y planificacion automatica
;; Fecha: 2026-05-12
;;
;; ============================================================
;; MOTIVACION DEL ESCENARIO (design rationale)
;; ------------------------------------------------------------
;; Este segundo escenario alternativo introduce tres cambios
;; significativos respecto al base, orientados a evaluar el
;; razonamiento OPORTUNISTA del planner optimal:
;;
;;   1. SE ANADE UN SEGUNDO LABORATORIO (L7).
;;      El dominio NO impone asignacion mineral->laboratorio; cualquier
;;      mineral puede entregarse en cualquier lab. Esto expande el
;;      espacio de soluciones: el planner debe ELEGIR el lab mas
;;      cercano para cada mineral con base en la topologia.
;;
;;   2. SE ANADE UN CUARTO MINERAL (M4) EN L7.
;;      M4 esta inicialmente en el mismo nodo del segundo laboratorio,
;;      lo que permite resolverlo en exactamente 2 acciones
;;      (pickup + deliver in situ) si el rover llega ahi. Esto pone
;;      a prueba si el planner aprovecha esta simplificacion natural.
;;
;;   3. SE ANADE UN MINERAL INTERMEDIO (M3) EN L6.
;;      L6 se sitúa estrategicamente entre los dos laboratorios
;;      (L5 <-> L6 <-> L7). Esto crea una decision real para el
;;      planner: entregar M3 en L5 o en L7. El optimo es entregar
;;      M3 en L7 para encadenar con M4 sin retroceso.
;;
;; HIPOTESIS QUE PRUEBA:
;;   El planner optimal track Delfi 1 debe descubrir la asignacion
;;   oportunista (M3 a L7 en lugar de L5) en lugar de tomar la
;;   ruta "obvia" de entregar todo en L5. Plan optimo: 20 acciones.
;;
;;   Si Delfi 1 entrega M3 en L5 (subóptimo), el plan tendria
;;   22 acciones — 2 mas. La diferencia es pequena pero significativa:
;;   demuestra capacidad de razonar sobre simetrias de assignamiento.
;;
;; QUE DEMUESTRA DEL MODELADO PDDL:
;;   - Multiplexacion de objetivos sobre recursos comunes: 4 minerales,
;;     2 laboratorios, sin asignacion fija → busqueda combinatoria.
;;   - El dominio sigue siendo el MISMO. Solo cambia la instancia.
;;   - El uso de `(:metric minimize (total-cost))` es crucial: sin
;;     metrica, cualquier plan valido seria aceptado y la riqueza
;;     del escenario se perderia.
;;
;; TOPOLOGIA:
;;
;;       L1 <----> L3 ----> L2
;;                 |         |
;;                 v         v
;;                L4 <-------+
;;                 |
;;                 v   (L4 <-> L5 bidir)
;;                L5 (lab #1)
;;                 |
;;                 v   (L5 <-> L6 bidir)
;;                L6 (M3 aqui)
;;                 |
;;                 v   (L6 <-> L7 bidir)
;;                L7 (lab #2 + M4 aqui)
;;
;; ARISTAS:
;;   L1 <-> L3       bidireccional (heredada del base)
;;   L3  -> L2       unidireccional (heredada del base)
;;   L2  -> L4       unidireccional (heredada del base)
;;   L3 <-> L4       bidireccional (heredada del base)
;;   L4 <-> L5       bidireccional (heredada del base)
;;   L5 <-> L6       bidireccional (nueva)
;;   L6 <-> L7       bidireccional (nueva)
;; ============================================================

(define (problem rover-problem-3)
  (:domain rover-mineral-transport)

  (:objects
    L1 L2 L3 L4 L5 L6 L7 - location
    M1 M2 M3 M4          - mineral
    R1                   - rover
  )

  (:init
    ;; Estado inicial: rover en L4, libre
    (at R1 L4)
    (free R1)

    ;; Distribucion de minerales
    (mineral-at M1 L1)
    (mineral-at M2 L2)
    (mineral-at M3 L6)
    (mineral-at M4 L7)

    ;; DOS laboratorios (ambos aceptan cualquier mineral)
    (lab-at L5)
    (lab-at L7)

    ;; Topologia
    ;; L1 <-> L3 (bidir)
    (path L1 L3)
    (path L3 L1)

    ;; L3 -> L2 (unidir)
    (path L3 L2)

    ;; L2 -> L4 (unidir)
    (path L2 L4)

    ;; L3 <-> L4 (bidir)
    (path L3 L4)
    (path L4 L3)

    ;; L4 <-> L5 (bidir)
    (path L4 L5)
    (path L5 L4)

    ;; L5 <-> L6 (bidir — nueva)
    (path L5 L6)
    (path L6 L5)

    ;; L6 <-> L7 (bidir — nueva)
    (path L6 L7)
    (path L7 L6)

    ;; Funcion de costo
    (= (total-cost) 0)
  )

  (:goal (and
    (analyzed M1)
    (analyzed M2)
    (analyzed M3)
    (analyzed M4)
  ))

  (:metric minimize (total-cost))
)

; plan
1. (move r1 l4 l3)
   deleted: (at r1 l4)
   added: (at r1 l3)
   goals met: 0 of 4
2. (move r1 l3 l2)
   deleted: (at r1 l3)
   added: (at r1 l2)
   goals met: 0 of 4
3. (pickup r1 m2 l2)
   deleted: (mineral-at m2 l2) (free r1)
   added: (carrying r1 m2)
   goals met: 0 of 4
4. (move r1 l2 l4)
   deleted: (at r1 l2)
   added: (at r1 l4)
   goals met: 0 of 4
5. (move r1 l4 l5)
   deleted: (at r1 l4)
   added: (at r1 l5)
   goals met: 0 of 4
6. (deliver r1 m2 l5)
   deleted: (carrying r1 m2)
   added: (analyzed m2) (free r1)
   goals met: 1 of 4
7. (move r1 l5 l4)
   deleted: (at r1 l5)
   added: (at r1 l4)
   goals met: 1 of 4
8. (move r1 l4 l3)
   deleted: (at r1 l4)
   added: (at r1 l3)
   goals met: 1 of 4
9. (move r1 l3 l1)
   deleted: (at r1 l3)
   added: (at r1 l1)
   goals met: 1 of 4
10. (pickup r1 m1 l1)
   deleted: (mineral-at m1 l1) (free r1)
   added: (carrying r1 m1)
   goals met: 1 of 4
11. (move r1 l1 l3)
   deleted: (at r1 l1)
   added: (at r1 l3)
   goals met: 1 of 4
12. (move r1 l3 l4)
   deleted: (at r1 l3)
   added: (at r1 l4)
   goals met: 1 of 4
13. (move r1 l4 l5)
   deleted: (at r1 l4)
   added: (at r1 l5)
   goals met: 1 of 4
14. (deliver r1 m1 l5)
   deleted: (carrying r1 m1)
   added: (analyzed m1) (free r1)
   goals met: 2 of 4
15. (move r1 l5 l6)
   deleted: (at r1 l5)
   added: (at r1 l6)
   goals met: 2 of 4
16. (pickup r1 m3 l6)
   deleted: (mineral-at m3 l6) (free r1)
   added: (carrying r1 m3)
   goals met: 2 of 4
17. (move r1 l6 l7)
   deleted: (at r1 l6)
   added: (at r1 l7)
   goals met: 2 of 4
18. (deliver r1 m3 l7)
   deleted: (carrying r1 m3)
   added: (analyzed m3) (free r1)
   goals met: 3 of 4
19. (pickup r1 m4 l7)
   deleted: (mineral-at m4 l7) (free r1)
   added: (carrying r1 m4)
   goals met: 3 of 4
20. (deliver r1 m4 l7)
   deleted: (carrying r1 m4)
   added: (analyzed m4) (free r1)
   goals met: 4 of 4
